Revit 2024 API
BuiltInFailures.RebarShapeFailures.CurveUnderconstrained Property
 Segment is underconstrained. It requires additional parameterized dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveUnderconstrained { get; }
Visual Basic
Public Shared ReadOnly Property CurveUnderconstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveUnderconstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace